#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azuread_application.aks will be created
+ resource "azuread_application" "aks" {
      + application_id             = (known after apply)
      + available_to_other_tenants = false
      + homepage                   = "https://homepage"
      + id                         = (known after apply)
      + identifier_uris            = [
          + "https://uri",
        ]
      + name                       = "AKS"
      + oauth2_allow_implicit_flow = true
      + object_id                  = (known after apply)
      + public_client              = (known after apply)
      + reply_urls                 = [
          + "https://replyurl",
        ]
      + type                       = "webapp/api"

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # azuread_service_principal.aks will be created
+ resource "azuread_service_principal" "aks" {
      + application_id = (known after apply)
      + display_name   = (known after apply)
      + id             = (known after apply)
      + object_id      = (known after apply)
      + tags           = [
          + "example",
          + "here",
          + "tags",
        ]

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # azuread_service_principal_password.aks will be created
+ resource "azuread_service_principal_password" "aks" {
      + end_date             = "2021-01-01T01:02:03Z"
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # azurerm_container_registry.acr will be created
+ resource "azurerm_container_registry" "acr" {
      + admin_enabled            = false
      + admin_password           = (sensitive value)
      + admin_username           = (known after apply)
      + georeplication_locations = [
          + "North Europe",
        ]
      + id                       = (known after apply)
      + location                 = "westeurope"
      + login_server             = (known after apply)
      + name                     = "intelionpr"
      + network_rule_set         = (known after apply)
      + resource_group_name      = "acr-pr-rg"
      + sku                      = "Premium"
      + tags                     = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }
    }

  # azurerm_kubernetes_cluster.aks_primary will be created
+ resource "azurerm_kubernetes_cluster" "aks_primary" {
      + dns_prefix            = "aks-primary-dns"
      + fqdn                  = (known after apply)
      + id                    = (known after apply)
      + kube_admin_config     = (known after apply)
      + kube_admin_config_raw = (sensitive value)
      + kube_config           = (known after apply)
      + kube_config_raw       = (sensitive value)
      + kubernetes_version    = (known after apply)
      + location              = "westeurope"
      + name                  = "aks-pr-primary"
      + node_resource_group   = (known after apply)
      + resource_group_name   = "aks-primary-pr-rg"
      + tags                  = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }

      + addon_profile {

          + oms_agent {
              + enabled                    = true
              + log_analytics_workspace_id = (known after apply)
            }
        }

      + agent_pool_profile {
          + count           = 1
          + dns_prefix      = (known after apply)
          + fqdn            = (known after apply)
          + max_pods        = (known after apply)
          + name            = "linux"
          + os_disk_size_gb = 30
          + os_type         = "Linux"
          + type            = "AvailabilitySet"
          + vm_size         = "Standard_B2s"
          + vnet_subnet_id  = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = "11.0.0.10"
          + docker_bridge_cidr = "172.17.0.1/16"
          + load_balancer_sku  = "basic"
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = "11.0.0.0/16"
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

      + service_principal {
          + client_id     = (known after apply)
          + client_secret = (sensitive value)
        }
    }

  # azurerm_kubernetes_cluster.aks_secondary will be created
+ resource "azurerm_kubernetes_cluster" "aks_secondary" {
      + dns_prefix            = "aks-secondary-dns"
      + fqdn                  = (known after apply)
      + id                    = (known after apply)
      + kube_admin_config     = (known after apply)
      + kube_admin_config_raw = (sensitive value)
      + kube_config           = (known after apply)
      + kube_config_raw       = (sensitive value)
      + kubernetes_version    = (known after apply)
      + location              = "northeurope"
      + name                  = "aks-pr-secondary"
      + node_resource_group   = (known after apply)
      + resource_group_name   = "aks-secondary-pr-rg"
      + tags                  = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }

      + addon_profile {

          + oms_agent {
              + enabled                    = true
              + log_analytics_workspace_id = (known after apply)
            }
        }

      + agent_pool_profile {
          + count           = 1
          + dns_prefix      = (known after apply)
          + fqdn            = (known after apply)
          + max_pods        = (known after apply)
          + name            = "linux"
          + os_disk_size_gb = 30
          + os_type         = "Linux"
          + type            = "AvailabilitySet"
          + vm_size         = "Standard_B2s"
          + vnet_subnet_id  = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = "11.0.0.10"
          + docker_bridge_cidr = "172.17.0.1/16"
          + load_balancer_sku  = "basic"
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = "11.0.0.0/16"
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

      + service_principal {
          + client_id     = (known after apply)
          + client_secret = (sensitive value)
        }
    }

  # azurerm_log_analytics_workspace.primary will be created
+ resource "azurerm_log_analytics_workspace" "primary" {
      + id                   = (known after apply)
      + location             = "westeurope"
      + name                 = "aks-loganalytics-westeurope"
      + portal_url           = (known after apply)
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = "loganalytics-primary-pr-rg"
      + retention_in_days    = (known after apply)
      + secondary_shared_key = (sensitive value)
      + sku                  = "PerGB2018"
      + tags                 = (known after apply)
      + workspace_id         = (known after apply)
    }

  # azurerm_resource_group.acr_rg will be created
+ resource "azurerm_resource_group" "acr_rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "acr-pr-rg"
      + tags     = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }
    }

  # azurerm_resource_group.aks_primary will be created
+ resource "azurerm_resource_group" "aks_primary" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "aks-primary-pr-rg"
      + tags     = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }
    }

  # azurerm_resource_group.aks_secondary will be created
+ resource "azurerm_resource_group" "aks_secondary" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aks-secondary-pr-rg"
      + tags     = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }
    }

  # azurerm_resource_group.core_primary will be created
+ resource "azurerm_resource_group" "core_primary" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "core-primary-pr-rg"
      + tags     = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }
    }

  # azurerm_resource_group.core_secondary will be created
+ resource "azurerm_resource_group" "core_secondary" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "core-secondary-pr-rg"
      + tags     = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }
    }

  # azurerm_resource_group.loganalytics_primary will be created
+ resource "azurerm_resource_group" "loganalytics_primary" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "loganalytics-primary-pr-rg"
      + tags     = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }
    }

  # azurerm_subnet.core_primary_aks will be created
+ resource "azurerm_subnet" "core_primary_aks" {
      + address_prefix       = "10.0.0.0/18"
      + id                   = (known after apply)
      + ip_configurations    = (known after apply)
      + name                 = "AKS"
      + resource_group_name  = "core-primary-pr-rg"
      + virtual_network_name = "core-primary"
    }

  # azurerm_subnet.core_secondary_aks will be created
+ resource "azurerm_subnet" "core_secondary_aks" {
      + address_prefix       = "10.1.0.0/18"
      + id                   = (known after apply)
      + ip_configurations    = (known after apply)
      + name                 = "AKS"
      + resource_group_name  = "core-secondary-pr-rg"
      + virtual_network_name = "core-secondary"
    }

  # azurerm_virtual_network.core_primary will be created
+ resource "azurerm_virtual_network" "core_primary" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "core-primary"
      + resource_group_name = "core-primary-pr-rg"
      + tags                = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # azurerm_virtual_network.core_secondary will be created
+ resource "azurerm_virtual_network" "core_secondary" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "core-secondary"
      + resource_group_name = "core-secondary-pr-rg"
      + tags                = {
          + "Component"    = "AKS"
          + "Environment"  = "Production"
          + "Organisation" = "Intelion"
          + "Team Name"    = "E-Commerce"
        }

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # azurerm_virtual_network_peering.core_primary will be created
+ resource "azurerm_virtual_network_peering" "core_primary" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = (known after apply)
      + id                           = (known after apply)
      + name                         = "WestEuropetoNorthEurope"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "core-primary-pr-rg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "core-primary"
    }

  # azurerm_virtual_network_peering.core_secondary will be created
+ resource "azurerm_virtual_network_peering" "core_secondary" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = (known after apply)
      + id                           = (known after apply)
      + name                         = "NorthEuropeToWestEurope"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "core-secondary-pr-rg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "core-secondary"
    }

  # random_string.password will be created
+ resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 20 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

*Workflow: `Terraform`, Action: `terraform-plan`*